package main.java.com.skillbox.addressbook;

public class MenuNavigator {

    // Определите тут необходимые поля.
    // Уверены, вам точно потребуется поле типа AddressBook.

    public void start() {
        // Напишите тут ваш код для вывода основного меню и
        // ввода выбора пользователя.
        // Советуем для каждого пункта меню написать свой метод,
        // заготовки для этих методов мы оставили для вас ниже.
    }

    private void printContacts() {
        // Здесь будет код для вывода списка контактов
    }

    private void removeContact() {
        // Здесь будет код для удаления контакта
    }

    private void newContact() {
        // Здесь будет код для добавления нового контакта
    }

    private void exit() {
        // Здесь будет код для выхода из программы
    }

    private int selectMainMenu() {
        // Здесь будет код для вывода основного меню и получения выбора
        // пользователя.
        // Метод должен вернуть номер опции, выбранной пользователем
        return 0;
    }
}
